{"pageProps":{"frontmatter":{"title":"Accelerating Hybrid Inference in SGLang with KTransformers CPU Kernels","author":"KVCache.AI and Approaching AI","date":"October 22, 2025","previewImg":"/images/blog/ktransformers/primary.png"},"content":"\n## Background: Hybrid Inference for Sparse MoE Models\nModern Mixture-of-Experts (MoE) language models such as **DeepSeek-V3** contain hundreds of billions of parameters, but only a small subset of experts are activated per token.\n\nThis **sparse activation** pattern makes MoE models ideal for **CPU/GPU hybrid inference**: the sparsely activated experts can run efficiently on CPUs with large memory capacity, while the dense and compute-intensive components — attention and shared experts — execute on GPUs with higher bandwidth and throughput.\n\n<img src=\"/images/blog/ktransformers/heterogeneous_computing.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 70%\"></img>\n\nThis hybrid design allows trillion-parameter models to be deployed on a single machine with limited GPU memory, enabling local inference for research and private applications.\n\nYet, fully exploiting both CPUs and GPUs remains challenging due to coordination overheads and underutilized compute, which limit effective throughput.\n\n## KTransformers: Unleashing the Full Potential of CPU/GPU Hybrid Inference for MoE Models\n\nTo solve the above problem, MadSys @ Tsinghua and Approaching.AI created the **KTransformers** project, presented at SOSP’25, introduces a collection of optimizations that make CPU/GPU collaboration for MoE inference far more efficient.\n\nIts improvements fall into three main categories:\n\n### 1. AMX-Specialized CPU Kernels\n\nKTransformers redesigns CPU computation with Intel AMX–optimized kernels and a tiling-aware memory layout that aligns weight storage with cache hierarchies. It also supports dynamic switching between AMX (for high-intensity prefill workloads) and AVX-512 (for lightweight decode). On a single Xeon socket, the AMX-optimized kernels can reach up to **21.3 TFLOPS** of sustained throughput — **3.9×** faster than PyTorch native implementations. This directly translates into substantially higher CPU-side expert throughput during prefill and overall token throughput in hybrid runs.\n\n### 2. Efficient Device Coordination\n\nTo reduce coordination costs between CPUs and GPUs, KTransformers introduces NUMA-aware tensor parallelism and CUDA Graph–backed scheduling.\n\nNUMA-aware tensor parallelism places expert weight slices in the local memory of each NUMA node so that compute is mostly local, avoiding expensive cross-NUMA memory traffic; this yields up to **63%** decoding throughput improvement on dual-socket servers.\n\nCUDA Graph integration captures the hybrid CPU/GPU execution as continuous graphs. To make captures robust, KTransformers uses asynchronous task scheduling so that CPU tasks and data transfers do not create “breakpoints” in the captured graph. Capturing the workload this way reduces GPU kernel-launch overhead from **over 20%** to **nearly zero**.\n\nTogether, these optimizations ensure both devices operate with minimal synchronization delays.\n\n### 3. Expert Deferral: Overlapping Model Execution\n\nKTransformers further introduces an Expert Deferral mechanism that reorders expert execution across layers. Some experts are deferred to later stages, allowing CPU expert computation to overlap with GPU attention processing.\n\n<img src=\"/images/blog/ktransformers/expert_deferral.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 70%\"></img>\n\nBecause modern Transformers use residual connections, they are inherently tolerant of small delays to intermediate computations. Consequently, deferring certain expert computations enhances scheduling flexibility at the cost of only slight changes in model behavior.\n\nThis mechanism increases concurrent utilization of both devices and yields up to **1.45× higher decoding throughput**, with accuracy variation below 0.5%.\n\n## Integrating KTransformers into SGLang\n\nSGLang now integrates KTransformers as a backend library to enable efficient CPU/GPU hybrid inference, combining GPU Tensor Parallelism with CPU/GPU Hybrid Expert Parallelism for MoE models. This integration supports inference across heterogeneous devices, where KTransformers provides highly optimized AMX-based CPU kernels that work seamlessly with GPU execution.\n\nWhile KTransformers focuses on single-GPU setups and high-efficiency CPU cooperation, SGLang excels at scaling across multiple GPUs, which is particularly advantageous in **high-concurrency scenarios**. In the hybrid setting, multiple GPUs can handle larger request contexts and perform fast attention computation, while experts are intelligently scheduled across CPUs and GPUs—storing frequently used (“hot”) experts on GPUs to alleviate CPU compute and bandwidth pressure.\n\nWith this joint design, users across diverse hardware configurations can fully utilize available resources, achieving better throughput, scalability, and cost efficiency.\n\nWe have already developed a proof-of-concept implementation, and the [roadmap](https://github.com/sgl-project/sglang/issues/11425) for full integration into SGLang is underway.\n\n## Installation\n\nTo use KTransformers hybrid inference with SGLang, you need to install both SGLang and the KTransformers CPU kernels (`kt-kernel`).\n\n### Prerequisites\n\nBefore installation, ensure your system meets the following requirements:\n\n- **CUDA**: Version 12.1 or above with proper PATH configuration\n- **Operating System**: Linux x86_64\n- **Compiler**: gcc, g++ >= 11\n- **Build Tools**: CMake >= 3.25 (Note: Ubuntu 22.04 LTS default CMake may be too old)\n- **Python**: Python 3.11 (via Miniconda3 or Anaconda3)\n\n### Step 1: Install SGLang\n\nFollow the official [SGLang installation guide](https://docs.sglang.ai/get_started/install.html) to install SGLang:\n\n```bash\npip install \"sglang[all]\"\n```\n\n### Step 2: Install KTransformers CPU Kernels\n\nThe KTransformers CPU kernels (`kt-kernel`) provide AMX-optimized computation for hybrid inference, for detailed installation instructions and troubleshooting, refer to the [official kt-kernel installation guide](https://github.com/kvcache-ai/ktransformers/blob/main/kt-kernel/README.md).\n\n## Usage Example\n\n### Downloading Models\n\nThe DeepSeek-R1 models optimized for KTransformers hybrid inference (including both GPU and CPU weights) can be downloaded from the [Approaching AI ModelScope profile](https://modelscope.cn/profile/ApproachingAI2024).\n\n### Launching the Server\n\nTo launch an SGLang server with KTransformers hybrid inference enabled, you can use the following command:\n\n```bash\npython -m sglang.launch_server \\\n  --host 0.0.0.0 \\\n  --port 30000 \\\n  --model /path/to/gpu-weight \\\n  --kt-amx-weight-path /path/to/cpu-weight \\\n  --kt-cpuinfer 80 \\\n  --kt-threadpool-count 2 \\\n  --kt-num-gpu-experts 200 \\\n  --kt-amx-method AMXINT4 \\\n  --attention-backend triton \\\n  --trust-remote-code \\\n  --mem-fraction-static 0.98 \\\n  --chunked-prefill-size 4096 \\\n  --max-running-requests 37 \\\n  --max-total-tokens 37000 \\\n  --served-model-name DeepSeek-R1-0528-FP8 \\\n  --enable-mixed-chunk \\\n  --tensor-parallel-size 8 \\\n  --enable-p2p-check \\\n  --disable-shared-experts-fusion\n```\n\n### Key Parameters\n\n- `--kt-amx-weight-path`: Path to the CPU-optimized model weights. These weights are pre-quantized and formatted for efficient AMX computation.\n- `--kt-cpuinfer`: Number of CPU cores dedicated to expert inference (e.g., 80 cores for dual-socket servers).\n- `--kt-threadpool-count`: Number of thread pools for parallel CPU execution. Typically set to 2 for dual-socket NUMA configurations.\n- `--kt-num-gpu-experts`: Number of \"hot\" experts to keep on GPU. More GPU experts reduce CPU compute pressure but require additional GPU memory. Adjust based on GPU capacity and workload patterns.\n- `--kt-amx-method`: CPU kernel optimization method. Use `AMXINT4` for int4-quantized models to leverage Intel AMX instructions for maximum throughput.\n\n### Hardware Requirements\n\nFor optimal performance with KTransformers hybrid inference:\n\n- **CPUs**: Modern Intel Xeon processors with AMX support (e.g., Sapphire Rapids or later) for maximum CPU expert throughput.\n- **Memory**: Sufficient DDR5 memory to hold all expert weights (typically 500GB+ for DeepSeek-V3-sized models).\n- **GPUs**: One or more GPUs with enough memory for attention layers, shared experts, and a subset of routed experts.\n- **NUMA**: Dual-socket configurations benefit from NUMA-aware thread pool assignment (`--kt-threadpool-count 2`).\n\nAfter launching the server, you can send inference requests via the OpenAI-compatible API endpoint at `http://0.0.0.0:30000`.\n\n## Benchmark Results (Preview)\n\n### Single-GPU + CPU Performance\n\nNative KTransformers conducted detailed performance evaluations on a single-GPU + CPU setup. Under the same configuration, SGLang integrated with KTransformers achieves comparable performance to native KTransformers.\n\nThe evaluations are set on a dual-socket Intel® Xeon® Platinum 8452Y server (36 cores × 2, 1 TB DDR5 × 2) with an NVIDIA A100 (40 GB) for full-precision models and an RTX 4080 (16 GB) for quantized models.\n\n<img src=\"/images/blog/ktransformers/prefill_performance.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 70%\"></img>\n\nIn the **prefill phase**, KTransformers consistently outperforms both baselines across all prompt lengths, benefiting from AMX-optimized CPU kernels and achieving **speedups of up to 20×**.\n\n<img src=\"/images/blog/ktransformers/decode_performance.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 70%\"></img>\n\nIn the **decode phase**, KTransformers also outperforms both baselines, with gains mainly attributed to reduced CPU/GPU coordination overhead, reaching **up to 4× speedup**.\n\n### Multi-GPU + CPU Performance\n\nWe further evaluate the multi-GPU + CPU hybrid inference capability enabled by integrating KTransformers into SGLang. Specifically, we tested int4-quantized DeepSeek-V3 on a system equipped with 8× L20 GPUs and dual-socket Intel Xeon Gold 6454S CPUs, using workloads with an average input length of 128 tokens and output length of 512 tokens.\n\n<img src=\"/images/blog/ktransformers/multigpu_performance.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 70%\"></img>\n\nThe table above presents the total throughput (tokens/s) under different levels of concurrency and varying numbers of GPUs. As shown, under single-concurrency conditions, the 8-GPU configuration provides only a limited improvement over the 1-GPU setup (an increase of merely 26%). However, under 8-way concurrency, the same 8-GPU configuration achieves a **264% throughput** gain compared to 1 GPU, demonstrating excellent usability—each request achieves nearly 20 tokens per second on average. The improvement mainly comes from placing more experts on GPUs, which reduces CPU memory accesses under bandwidth bottlenecks.\n\n#### ShareGPT Benchmark on NVIDIA L20 × 8 Setup\n\nWe further evaluated the SGLang + KTransformers integration on a GPU setup using **8× NVIDIA L20 GPUs** with an **Intel(R) Xeon(R) Gold 6454S CPU**. The benchmark was conducted on **DeepSeek-R1-0528**, a large-scale MoE model from the DeepSeek-R1 series, using the ShareGPT dataset with 1000 conversation requests (301K input tokens, 188K output tokens).\n\n**System Configuration:**\n- GPUs: 8× NVIDIA L20\n- CPU: Intel(R) Xeon(R) Gold 6454S\n- Model: DeepSeek-R1-0528 (FP8 quantized MoE model)\n- Dataset: ShareGPT (1000 requests)\n\n**Benchmark Commands:**\n\nFirst, launch the SGLang server:\n\n```bash\nPYTORCH_CUDA_ALLOC_CONF=expandable_segments:True \\\npython -m sglang.launch_server \\\n  --host 0.0.0.0 \\\n  --port 30000 \\\n  --model models/DeepSeek-R1-0528-GPU-weight \\\n  --kt-amx-weight-path models/DeepSeek-R1-0528-CPU-weight \\\n  --kt-cpuinfer 60 \\\n  --kt-threadpool-count 2 \\\n  --kt-num-gpu-experts 200 \\\n  --kt-amx-method AMXINT4 \\\n  --attention-backend triton \\\n  --trust-remote-code \\\n  --mem-fraction-static 0.98 \\\n  --chunked-prefill-size 4096 \\\n  --max-running-requests 40 \\\n  --max-total-tokens 40000 \\\n  --served-model-name DeepSeek-R1-0528-FP8 \\\n  --enable-mixed-chunk \\\n  --tensor-parallel-size 8 \\\n  --enable-p2p-check \\\n  --disable-shared-experts-fusion\n```\n\nThen, run the benchmark in a separate terminal:\n\n```bash\npython -m sglang.bench_serving \\\n  --backend sglang \\\n  --host 127.0.0.1 \\\n  --port 30000 \\\n  --num-prompts 1000 \\\n  --model models/DeepSeek-R1-0528-GPU-weight\n```\n\n**Performance Results:**\n\n| Metric | Value |\n|--------|-------|\n| Total Token Throughput | 227.85 tok/s |\n| Output Token Throughput | 87.58 tok/s |\n| Request Throughput | 0.46 req/s |\n| Mean Inter-Token Latency (ITL) | 431.61 ms |\n| Median Inter-Token Latency | 299.18 ms |\n| P99 Inter-Token Latency | 1935.13 ms |\n\nThis setup demonstrates that SGLang + KTransformers can effectively leverage consumer-grade GPUs for hybrid inference, achieving **over 220 tokens/s total throughput** on trillion-parameter MoE models. The relatively low inter-token latency (median 299ms) ensures smooth streaming generation for interactive applications.\n\n## Acknowledgements\n\nWe would like to thank everyone in the community that helped make this effort possible.\n\n**KVCache.AI team**: Boxin Zhang, Jianwei Dong, Hongtao Chen, Weiyu Xie, Shaoyuan Chen, Chen Lin, Chengyu Qiu, Yuening Zhu, Jingqi Tang, Qingliang Ou, Yongwei Wu and Mingxing Zhang from MadSys @ Tsinghua University.\n\n**Approaching AI**: Jiahao Wang, Ziwei Yuan, Yaochen Han,  Jiaqi Liao, Xianglin Chen, Zhiyuan Ai, Yongsen Hu, Zhuo Wang, Daocheng Ye, Yanlong Wu, Yufeng Tian, Heng Guo, Hao Wu, Zirui Li, Yingqi Tian, Yue Qin, Xin Qu, Baijin Hao, Donghui Liu.\n\n**SGLang team and community:** Jingyi Chen, Shangming Cai, Lianmin Zheng, Yineng Zhang and many others for their insightful review comments on this PR and for their work on SGLang framework.\n\n## Related resources\n\nRepo：https://github.com/kvcache-ai/ktransformers\n\nSOSP25 Paper：https://madsys.cs.tsinghua.edu.cn/publication/ktransformers-unleashing-the-full-potential-of-cpu/gpu-hybrid-inference-for-moe-models/\n","slug":"2025-10-22-KTransformers"},"__N_SSG":true}