{"pageProps":{"frontmatter":{"title":"Introducing Miles — RL Framework To Fire Up Large-Scale MoE Training","author":"RadixArk Team","date":"November 19, 2025","previewImg":"/images/blog/miles/miles.png"},"content":"\n> *A journey of a thousand miles is made one small step at a time.*\n\nToday, we are releasing Miles, an enterprise-grade reinforcement learning framework tailored for large-scale MoE training and production workloads.\n\nMiles is built on top of slime, the lightweight RL framework that has quietly powered many of today’s post-training pipelines and large MoE runs (including GLM-4.6). While slime proved that lightweight design works, Miles takes the next step: delivering the reliability, scale, and control needed for real-world enterprise deployments.\n\nGitHub: [radixark/miles](https://github.com/radixark/miles).\n\n## Why Miles?\n\nEvery mile of progress begins with one well-placed step - slime it is. As a very lightweight and customizable RL framework, slime has been growing popular across the community. It has also been battle-tested in large MoE training, where it is used to train GLM-4.6. slime comes with a few elegant design principles:\n\n### Open-to-Use Performance\n\nWe provide native, structured support for SGLang and Megatron's full optimization stack, keeping pace with the rapid evolution of inference and training frameworks.\n\n### Modular Design\n\nKey components—Algorithm, Data, Rollout, and Eval—are fully decoupled. You can plug in new agent types, reward functions, or sampling strategies with minimal code changes.\n\n### Built for Researchers\n\nEvery abstraction is readable and hackable. Algorithm researchers can modify importance sampling, rollout logic, or loss dynamics without digging into low-level code. We also provide inference-only and training-only debugging modes for fast diagnosis.\n\n### Community-Driven\n\nslime evolved through real-world feedback from the LMSYS and SGLang communities, embodying what open collaboration across research and engineering can achieve.\n\n## What's New?\n\nMiles builds on slime but focuses on new hardware (e.g., GB300), large-scale MoE RL, and production-grade stability. Recent additions include (most of which we've also upstreamed to slime):\n\n### True On-Policy\n\nBeyond deterministic inference (bitwise identical results), we now support [true on-policy](https://github.com/THUDM/slime/tree/main/examples/true_on_policy) via an infrastructure approach.\n\n- We've eliminated the mismatch between training and inference to exactuly 0 kl divergence.\n- This uses Flash Attention 3, DeepGEMM, batch invariant kernels from Thinking Machines Lab, and `torch.compile`. We also aligned numeric operations between training and inference.\n\n<img src=\"https://raw.githubusercontent.com/THUDM/slime/refs/heads/main/examples/true_on_policy/src/train_rollout_abs_diff.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 60%\"></img>\n\n### Memory Improvements\n\nTo maximize performance without hitting OOM errors, we've made several updates:\n\n- Added error propagation to avoid crashes on benign OOMs.\n- Implemented memory margins to fix NCCL-related OOMs.\n- Fixed excessive memory usage in FSDP.\n- Added support for move-based and partial offloading, plus host peak memory savings.\n\n### Speculative Decoding with Online Draft Model Training\n\nFreezing the draft model in RL prevents it from following the target model's policy, which reduces accept length and speedup. We now perform [online SFT on the draft model](https://github.com/zhaochenyang20/Awesome-ML-SYS-Tutorial/blob/main/rlhf/slime/spec/readme-en.md) throughout RL.\n\n- Achieves 25%+ rollout speedup vs. a frozen MTP, especially in late training stages.\n- Supports MTP with sequence packing + CP, loss masks with edge-case handling, LM head/embedding gradient isolation, and Megatron↔SGLang weight syncing.\n\n<img src=\"https://raw.githubusercontent.com/zhaochenyang20/Awesome-ML-SYS-Tutorial/refs/heads/main/rlhf/slime/spec/pic/overall-throughput.png\" style=\"display:block; margin-top: auto; margin-left: auto; margin-right: auto; margin-bottom: auto; width: 60%\"></img>\n\n### Other Improvements\n\nWe've enhanced the FSDP training backend, allowed independent deployment of the rollout subsystem, and added more debug utilities (metrics, post-hoc analyzers, better profilers). We also included a formal mathematics (Lean) example with [SFT/RL scripts](https://github.com/radixark/miles/tree/main/examples/formal_math/single_round).\n\n## Roadmap\n\nWe are committed to supporting enterprise-grade RL training. Upcoming efforts include:\n\n- Large-scale MoE RL examples on new hardware (e.g., GB300).\n- Multi-modal training support.\n- Rollout accelerations:\n  - Compatibility with SGLang spec v2.\n  - Advanced speculative decoding (e.g., EAGLE3, multi-spec layer).\n- Better resource allocation for balanced training & serving in large-scale async training.\n- Elasticity to GPU failures.\n\n## Acknowledgment\n\nMiles wouldn't exist without the slime authors and the broader SGLang RL community.\n\nWe invite researchers, startups, and enterprise teams to explore slime and Miles—pick the one that fits your needs—and join us in making reinforcement learning efficient and reliable. We're listening to the community and actively working on Miles to build a production-ready training environment.\n","slug":"2025-11-19-miles"},"__N_SSG":true}