{"pageProps":{"frontmatter":{"title":"NVIDIA DGX Spark In-Depth Review: A New Standard for Local AI Inference","author":"Jerry Zhou and Richard Chen","date":"October 13, 2025","previewImg":"/images/blog/nvidia_dgx_spark/product_1.jpg"},"content":"\nThanks to NVIDIA’s early access program, we are thrilled to get our hands on the NVIDIA DGX™ Spark. It’s quite an unconventional system, as NVIDIA rarely releases compact, all-in-one machines that bring supercomputing-class performance to a desktop workstation form factor.\n\nOver the past year, SGLang has been rapidly expanding its developer base in the datacenter segment, recognized by the inference community for its great performance. Successfully deploying DeepSeek with Prefill-decode Disaggregation (PD) and Expert Parallelism (EP) at large scale, running on both <a href=\"https://lmsys.org/blog/2025-05-05-large-scale-ep/\" target=\"_blank\">**96 NVIDIA H100 GPU clusters**</a> and the latest <a href=\"https://lmsys.org/blog/2025-09-25-gb200-part-2/\" target=\"_blank\">**GB200 NVL72 systems**</a>, SGLang has continually pushed the boundaries of large-scale inference performance and developer productivity.\n\nInspired by the capabilities of the DGX Spark, for the first time, SGLang is now expanding beyond the datacenter and into the consumer market, bringing its proven inference framework directly to developers and researchers everywhere. In this review, we’ll be taking a close look at this beautiful machine, from its exterior aesthetics to its performance and use cases.\n\n> Also check out our video review <a href=\"https://youtu.be/-3r2woTQjec\" target=\"_blank\">here</a>.\n\n![](/images/blog/nvidia_dgx_spark/product_1.jpg)\n\n## Exterior\n\nThe DGX Spark is a gorgeous piece of engineering. It features a full-metal chassis with a sleek champagne-gold finish. Both the front and rear panels are built with metal foam, reminding me of the design of NVIDIA DGX A100 and H100.\n\nAround the back, the DGX Spark offers an impressive array of connectivity options: a power button, four USB-C ports (with the leftmost supporting up to **240 W of power delivery**), an HDMI port, a **10 GbE RJ-45 Ethernet port**, and **two QSFP ports driven by NVIDIA ConnectX-7 NIC capable of up to 200 Gbps**. These interfaces allow two DGX Spark units to be connected together, allowing them to run even larger AI models.\n\nThe use of USB Type-C for power delivery is a particularly interesting design choice, one that’s virtually unheard of on other desktop machines. Comparable systems like the Mac Mini or Mac Studio rely on the standard C5/C7 power connector, which is far more secure but also bulkier. NVIDIA likely opted for USB-C to keep the power supply external, freeing up valuable internal space for the cooling system. The trade-off, however, is that you’ll want to be extra careful not to accidentally tug the cable loose.\n\n![](/images/blog/nvidia_dgx_spark/product_2.jpg)\n\n## Hardware Capabilities\n\nOn the hardware side, the DGX Spark packs remarkable performance for its size and power envelope. At its core is the NVIDIA GB10 Grace Blackwell Superchip, designed specifically for this device. It integrates 10 Cortex-X925 performance cores and 10 Cortex-A725 efficiency cores, for a total of 20 CPU cores.\n\nOn the GPU side, the GB10 delivers up to **1 PFLOP of sparse FP4 tensor performance**, placing its AI capability roughly between that of an RTX 5070 and 5070 Ti. The standout feature is its **128 GB of coherent unified system memory**, shared seamlessly between the CPU and GPU. This unified architecture allows the DGX Spark to load and run large models directly without the overhead of system-to-VRAM data transfers. With the help of its dual QSFP Ethernet ports with an aggregate bandwidth of 200 Gb/s, two DGX Spark units can be connected together to operate as a small cluster, enabling distributed inference of even larger models. According to NVIDIA, two interconnected DGX Sparks can handle models with up to **405 billion parameters in FP4**.\n\nHowever, the only downside of this machine lies in memory bandwidth, the unified memory is LPDDR5x, offering up to **273 GB/s**, shared across both CPU and GPU. As we’ll see later, this limited bandwidth is expected (and empirically shown) to be the key bottleneck in AI inference performance. Nonetheless, the 128GB of memory enables DGX Spark to run models that are too large for most desktop systems.\n\n![](/images/blog/nvidia_dgx_spark/product_3.jpg)\n\n## Performance\n\nWe benchmarked several open-weight large language models on the DGX Spark using both **SGLang** and **Ollama**. Our findings show that while the DGX Spark can indeed load and run very large models, such as **GPT-OSS 120B** and **Llama 3.1 70B,** these workloads are best suited for **prototyping and experimentation** rather than production. The DGX Spark truly shines when serving **smaller models**, especially when **batching** is utilized to maximize throughput.\n\n### Methodology\n\n> ⚠️ **Note:** Since software support for the DGX Spark is still in its early stages, the benchmark results presented in this section may become outdated as future software updates improve performance and compatibility.\n\n#### Test Devices\n\nWe prepared the following systems for benchmarking:\n\n* **NVIDIA DGX Spark**  \n* **NVIDIA RTX PRO™ 6000 Blackwell Workstation Edition**  \n* **NVIDIA GeForce RTX 5090 Founders Edition**  \n* **NVIDIA GeForce RTX 5080 Founders Edition**  \n* **Apple Mac Studio (M1 Max, 64 GB unified memory)**  \n* **Apple Mac Mini (M4 Pro, 24 GB unified memory)**\n\n#### Benchmark Models\n\nWe evaluated a variety of open-weight large language models using two frameworks, **SGLang** and **Ollama**, as summarized below:\n\n| Framework | Batch Size | Models & Quantization |\n| :---- | :---- | :---- |\n| **SGLang** | 1–32 | Llama 3.1 8B (FP8)<br>Llama 3.1 70B (FP8)<br>Gemma 3 12B (FP8)<br>Gemma 3 27B (FP8)<br>DeepSeek-R1 14B (FP8)<br>Qwen 3 32B (FP8) |\n| **Ollama** | 1 | GPT-OSS 20B (MXFP4)<br>GPT-OSS 120B (MXFP4)<br>Llama 3.1 8B (q4\\_K\\_M / q8\\_0)<br>Llama 3.1 70B (q4\\_K\\_M)<br>Gemma 3 12B (q4\\_K\\_M / q8\\_0)<br>Gemma 3 27B (q4\\_K\\_M / q8\\_0)<br>DeepSeek-R1 14B (q4\\_K\\_M / q8\\_0)<br>Qwen 3 32B (q4\\_K\\_M / q8\\_0) |\n\nWe also tested **speculative decoding (EAGLE3) with SGLang** on some of the models listed above. We excluded models that exceeded the available RAM or VRAM capacity of the target machine.\n\n### Results\n\n> Full benchmark results can be found <a href=\"https://docs.google.com/spreadsheets/d/1SF1u0J2vJ-ou-R_Ry1JZQ0iscOZL8UKHpdVFr85tNLU/edit?usp=sharing\" target=\"_blank\">here</a>.\n\n#### Overall Performance\n\nWhile the DGX Spark demonstrates impressive engineering for its size and power envelope, its raw performance is understandably limited compared to full-sized discrete GPU systems.\n\nFor example, running **GPT-OSS 20B (MXFP4)** in **Ollama**, the Spark achieved **2,053 tps prefill / 49.7 tps decode**, whereas the **RTX Pro 6000 Blackwell** reached **10,108 tps / 215 tps,** roughly **4× faster**. Even the **GeForce RTX 5090** delivered **8,519 tps / 205 tps**, confirming that the Spark’s unified LPDDR5x memory bandwidth is the main limiting factor.\n\nHowever, for smaller models, particularly **Llama 3.1 8B**, the DGX Spark held its own. With **SGLang** at batch 1, it achieved **7,991 tps prefill / 20.5 tps decode**, scaling up linearly to **7,949 tps / 368 tps** at batch 32, demonstrating excellent batching efficiency and strong throughput consistency across runs.\n\n#### Strength in Compact, Unified-Memory Workloads\n\nOne of the DGX Spark’s defining strengths lies in its **128 GB of coherent unified memory**, which allows both CPU and GPU to access the same address space.\n\nThis enables large models, such as **Llama 3.1 70B**, **Gemma 3 27B**, or even **GPT-OSS 120B,** to load **directly into memory** without the traditional system-to-VRAM transfer overhead. Despite its compact form factor, the Spark successfully ran **Llama 3.1 70B (FP8)** at **803 tps prefill / 2.7 tps decode**, which is remarkable for a workstation that sits quietly on a desk.\n\nThis unified-memory design makes DGX Spark particularly valuable for **prototyping**, **model experimentation**, and **edge-AI research**, where seamless memory access is often more useful than raw TFLOPs.\n\n#### Speculative Decoding Acceleration\n\nTo further explore performance optimization on the DGX Spark, we enabled **speculative decoding** using **EAGLE 3** within **SGLang**. This technique allows a smaller “draft” model to propose multiple tokens ahead, while the larger target model verifies them in parallel.\n\nWith speculative decoding enabled, we observed up to a **2× speed-up** in end-to-end inference throughput compared to standard decoding across multiple models, such as **Llama 3.1 8B**.\n\nThis improvement effectively mitigates part of the unified-memory bandwidth limitation and demonstrates that **software-level innovations** such as speculative decoding can meaningfully enhance inference performance on compact, bandwidth-constrained systems like the DGX Spark.\n\n#### Efficiency and Thermal Design\n\nThe DGX Spark maintains sustained throughput across high-intensity tests without thermal throttling. Even under full load, e.g., **SGLang DeepSeek-R1 14B (FP8)** at batch 8 achieving **2,074 tps / 83.5 tps**, fan noise and temperature remained stable, highlighting NVIDIA’s excellent **metal-foam cooling design** and well-optimized **power delivery system**.\n\nIts **USB-C power input** (up to 240 W) and external PSU allow for greater thermal headroom inside the chassis, a clear advantage for long-running workloads compared to compact consumer systems like the Mac Mini or Mac Studio, which showed thermal drop-off in similar tests.\n\n#### Summary\n\nIn short, the DGX Spark is **not built to compete head-to-head** with full-sized Blackwell or Ada-Lovelace GPUs, but rather to bring the DGX experience into a compact, developer-friendly form factor.  \nIt’s an ideal platform for:\n\n* **Model prototyping and experimentation**  \n* **Lightweight on-device inference**  \n* **Research on memory-coherent GPU architectures**\n\nIt’s a **gorgeous, well-engineered mini supercomputer** that trades raw power for accessibility, efficiency, and elegance, and in those areas, it absolutely shines.\n\n![](/images/blog/nvidia_dgx_spark/product_4.jpg)\n\n## Use Cases\n\n### SGLang Model Serving\n\nThe DGX Spark comes with Docker preinstalled, allowing you to serve open-weight models via SGLang with just a single command:\n\n```bash\ndocker run --gpus all \\\n    --shm-size 32g \\\n    -p 30000:30000 \\\n    -v ~/.cache/huggingface:/root/.cache/huggingface \\\n    --env \"HF_TOKEN=<secret>\" \\\n    --ipc=host \\\n    lmsysorg/sglang:spark \\\n    python3 -m sglang.launch_server --model-path meta-llama/Llama-3.1-8B-Instruct --quantization fp8 --host 0.0.0.0 --port 30000\n```\n\nReplace `<secret>` with your own Hugging Face access token.\n\n#### Enabling Speculative Decoding (EAGLE3)\n\nTo enable **speculative decoding** using **EAGLE3**, simply run the following command:\n\n```bash\ndocker run --gpus all \\\n    --shm-size 32g \\\n    -p 30000:30000 \\\n    -v ~/.cache/huggingface:/root/.cache/huggingface \\\n    --env \"HF_TOKEN=<secret>\" \\\n    --env \"SGLANG_ALLOW_OVERWRITE_LONGER_CONTEXT_LEN=1\" \\\n    --ipc=host \\\n    lmsysorg/sglang:spark \\\n    python3 -m sglang.launch_server --model-path meta-llama/Llama-3.1-8B-Instruct --quantization fp8 --host 0.0.0.0 --port 30000 \\\n    --speculative-algorithm EAGLE3 \\\n    --speculative-draft-model-path jamesliu1/sglang-EAGLE3-Llama-3.1-Instruct-8B \\\n    --speculative-num-steps 5 \\\n    --speculative-eagle-topk 8 \\\n    --speculative-num-draft-tokens 32 \\\n    --mem-fraction 0.6 \\\n    --cuda-graph-max-bs 2 \\\n    --dtype float16\n```\n\nWith speculative decoding enabled, SGLang can leverage a smaller draft model to predict multiple tokens ahead, effectively **doubling inference throughput** compared to standard decoding.\n\n#### Sending Requests via the OpenAI-Compatible API\n\nOnce SGLang successfully initializes, you can interact with your model through OpenAI-compatible API endpoints:\n\n```bash\ncurl http://localhost:30000/v1/chat/completions \\\n    -H \"Content-Type: application/json\" \\\n    -d '{\n        \"messages\": [\n            {\n                \"role\": \"system\",\n                \"content\": \"You are a helpful assistant.\"\n            },\n            {\n                \"role\": \"user\",\n                \"content\": \"How many letters are there in the word SGLang?\"\n            }\n        ]\n    }'\n```\n\n![](/images/blog/nvidia_dgx_spark/demo_1.jpg)\n\n### Chatting with Local Model\n\nOnce you have **SGLang** set up and serving a model, you can easily connect it to **Open WebUI** to chat with any open-weight model you like. Open WebUI provides a sleek, browser-based interface that’s fully compatible with OpenAI-style APIs, meaning it works seamlessly with your local SGLang server. With just a quick configuration pointing to your DGX Spark’s endpoint, you can interact with models such as **Llama 3**, **Gemma 3**, or **DeepSeek-R1** directly from your browser, no cloud dependencies, no latency, and complete control over your data.\n\n![](/images/blog/nvidia_dgx_spark/demo_2.jpg)\n\n### Coding with Local Model\n\nOne of the most practical ways to utilize the DGX Spark is as a **local coding assistant,** completely offline and secure.\n\nBy combining **Zed**, a modern AI-integrated code editor, with **Ollama**, you can run **GPT-OSS 20B** locally to power code completion, inline chat, and smart refactoring without relying on the cloud.\n\n#### Step 1\\. Install Ollama\n\n```bash\ncurl -fsSL https://ollama.com/install.sh | sh\n```\n\n#### Step 2\\. Pull GPT-OSS 20B for Coding\n\n```bash\nollama pull gpt-oss:20b\n```\n\n#### Step 3\\. Integrate Zed with Ollama\n\nInstall Zed:\n\n```bash\ncurl -f https://zed.dev/install.sh | sh\n```\n\nZed automatically detects local models served by Ollama, allowing you to start using the built-in chat assistant immediately after launching the editor.\n\n![](/images/blog/nvidia_dgx_spark/demo_3.jpg)\n\n## Conclusion\n\nThe **NVIDIA DGX Spark** is a fascinating glimpse into the future of personal AI computing. It takes what was once reserved for data centers: large memory, high-bandwidth Ethernet interconnects, and Blackwell-class performance, and distills it into a compact, beautifully engineered desktop form factor. While it doesn’t rival full-size DGX servers or discrete RTX GPUs in raw throughput, it shines in accessibility, efficiency, and versatility.\n\nFrom running **SGLang** and **Ollama** for local model serving, to experimenting with **speculative decoding (EAGLE3)**, to exploring distributed inference through **dual-Spark clustering**, the platform proves itself as more than just a miniature supercomputer. It’s a developer’s sandbox for the next era of AI.\n\nThe NVIDIA DGX Spark isn’t built to replace cloud-scale infrastructure; it’s built to **bring AI experimentation to your desk**. Whether you’re benchmarking open-weight LLMs, developing inference frameworks, or building your own private coding assistant, the Spark empowers you to do it all locally, quietly, elegantly, and with NVIDIA’s unmistakable engineering polish.\n","slug":"2025-10-13-nvidia-dgx-spark"},"__N_SSG":true}