{"pageProps":{"frontmatter":{"title":"OME: Revolutionizing LLM Infrastructure with Model-Driven Architecture","author":"The Oracle Team","date":"July 8, 2025","previewImg":"/images/blog/ome/ome.jpg"},"content":"\n## The Tale of Two Teams: Why Model Serving Is Broken\n\nIn any large organization deploying LLMs, two distinct teams emerge with conflicting needs:\n\n**The ML Engineers** spend months benchmarking models, experimenting with serving technologies, and crafting optimal deployment strategies. Each model demands different configurations—tensor parallelism for Llama 70B, expert parallelism for DeepSeek V3/R1, specialized settings for multimodal models. The parameters are endless: batch sizes, KV cache configurations, quantization levels. Worse, these configurations shift dramatically across GPU types (H100 vs A100 vs L40S).\n\n**The Production Engineers and Data Scientists** just want to deploy models. They shouldn’t need to understand the intricacies of tensor parallelism or why a particular model needs 4 GPUs with NVLink. They have customers waiting, applications to build, and business value to deliver.\n\nThis gap creates a fundamental problem: MLEs need a way to encode their hard-won serving knowledge into reusable blueprints. Production teams need to deploy models without becoming distributed systems experts. **The missing link? A system that understands models as first-class citizens.**\n\n## The Birth of OME\n\nThe Oracle Cloud Infrastructure (OCI) GenAI team faced this exact challenge at scale. Supporting numerous models across diverse GPU hardware, they watched deployment cycles stretch into months. Each new model meant:\n- Weeks of MLE experimentation to find optimal configurations\n- Complex documentation that production teams struggled to follow\n- Deployment failures due to misconfiguration\n- Inability to reuse knowledge across similar models\n\nThe breakthrough came from a simple insight: **The model itself should drive the deployment.**\n\nA Llama model isn’t just a file—it contains metadata about its architecture, parameter count, and requirements. By making the system model-aware rather than deployment-driven, they could bridge the gap between ML expertise and production simplicity.\n\nThis led to OME (Open Model Engine): a Kubernetes operator that treats models as first-class resources. The results were dramatic:\n- Model onboarding time: **Months → Days**\n- Configuration errors: **Dramatically reduced**\n- MLE knowledge: **Captured and reused automatically**\n- Production deployment: **Simple YAML with just a few lines**\n\nBut here’s what makes it revolutionary: the model-driven architecture makes it easy to encode and reuse sophisticated deployment strategies:\n- **Multi-node serving**: Deploy massive models like DeepSeek V3 (685B) across multiple nodes with a simple configuration\n- **Prefill-decode disaggregation**: Separate compute-intensive prefill from memory-bound decode, with each component scaling independently\n- **Flexible architectures**: Both prefill and decode can run in single-node or multi-node configurations based on your needs\n- **Serverless deployment**: Scale-to-zero for cost efficiency when models aren’t in use\n- **Business-driven scaling**: Complex autoscaling based on KV cache, tokens/second, latency targets, or any custom metric\n\nThe model-driven approach doesn’t constrain you—it liberates you. Because OME understands models deeply, it can support any deployment pattern your MLEs design while keeping the interface simple for production teams.\n\n**Enter OME**: A Kubernetes-native platform where models become first-class citizens. Let’s explore how OME’s architecture transforms the chaos of LLM deployment into an elegant, scalable system that serves everyone from ML researchers to production engineers.\n\n## The OME Architecture: Models at the Center\n\n![ome-architecture.svg](/images/blog/ome/ome-architecture.svg)\n\n### **Layer 1: Kubernetes API Layer**\n\nWhile users—MLEs, data scientists, production engineers, and applications—interact with OME through simple interfaces, the real magic happens in the Kubernetes API layer below.\n\n### **Custom Resources - The Foundation of Model-Driven Architecture**\n\nAt the heart of OME lies its Custom Resource Definitions (CRDs), which transform Kubernetes from a generic container orchestrator into an ML platform. These aren’t just configuration files—they’re the language through which you express your ML requirements.\n\n### **BaseModel/ClusterBaseModel: Models as First-Class Citizens**\n\n**What is a Base Model?**\n\nA Base Model in OME is a Kubernetes resource that represents a foundation AI model (like GPT, Llama, or Mistral) that you want to use for inference workloads. Think of it as a blueprint that tells OME where to find your model, how to download it, and where to store it on your cluster nodes.\n\nWhen you create a BaseModel resource, OME automatically handles the complex process of downloading the model files, parsing the model’s configuration to understand its capabilities, and making it available across your cluster nodes where AI workloads can use it.\n\n**BaseModel vs ClusterBaseModel**\n\nOME provides two types of model resources:\n\n- **BaseModel** is namespace-scoped, meaning it exists within a specific Kubernetes namespace. If you create a BaseModel in the “team-a” namespace, only workloads in that namespace can use it. This is perfect for team-specific models or when you want to isolate model access.\n- **ClusterBaseModel** is cluster-scoped, meaning it’s available to workloads in any namespace across your entire cluster. This is ideal for organization-wide models that multiple teams need to access, like a shared Llama-3 model that everyone uses.\n\nBoth types use exactly the same specification format—the only difference is their visibility scope.\n\nTraditional platforms treat models as static files to be downloaded and mounted. OME revolutionizes this by making models intelligent, versioned resources that understand their own requirements:\n\n```yaml\napiVersion: ome.io/v1beta1\nkind: ClusterBaseModel\nmetadata:\n  name: llama-3-70b-instruct\nspec:\n  vendor: meta\n  modelType: llama\n  modelArchitecture: LlamaForCausalLM\n  modelParameterSize: \"70B\"\n  quantization: fp16\n  storage:\n    storageUri: \"hf://meta-llama/Llama-3.3-70B-Instruct\"\n    path: \"/models/llama-3.3-70b\"\n    nodeSelector:\n      gpu.memory: \"80Gi\"  # Only download to nodes with sufficient GPU memory\n```\n\nWhen you create a BaseModel resource, OME’s control plane and data plane components work together to make the model available across your cluster. The BaseModel CRD acts as the declarative specification, while the actual work of downloading, parsing, and distributing models happens in the data plane through the Model Agent.\n\n### **ServingRuntime: The Brain of Runtime Selection**\n\nClusterServingRuntime is a cluster-scoped resource that manages the runtime environment for model serving. A ClusterServingRuntime defines the templates for Pods that can serve one or more particular models. Each ClusterServingRuntime defines key information such as the container image of the runtime and a list of the models that the runtime supports. Other configuration settings for the runtime can be conveyed through environment variables in the container specification.\n\nThese CRDs allow for improved flexibility and extensibility, enabling users to quickly define or customize reusable runtimes without having to modify any controller code or any resources in the controller namespace. The only difference between ServingRuntime and ClusterServingRuntime is that one is namespace-scoped and the other is cluster-scoped.\n\n```yaml\napiVersion: ome.io/v1beta1\nkind: ClusterServingRuntime\nmetadata:\n  name: sglang-llama-70b\nspec:\n  supportedModelFormats:\n    - modelFormat:\n        name: safetensors\n      modelArchitecture: LlamaForCausalLM\n      modelSizeRange:\n        min: \"65B\"\n        max: \"75B\"\n      autoSelect: true\n      priority: 100\n```\n\nFull runtime specifications for advanced deployments can be found in the OME repository:\n- [Llama 4 Maverick PD Runtime](https://github.com/sgl-project/ome/blob/main/config/runtimes/srt/llama-4-maverick-17b-128e-instruct-fp8-pd-rt.yaml) - Prefill-decode disaggregated configuration\n- [DeepSeek RDMA PD Runtime](https://github.com/sgl-project/ome/blob/main/config/runtimes/srt/deepseek-rdma-pd-rt.yaml) - Multi-node expert parallel serving with RDMA\n\nServingRuntimes define how to serve different model types, with the actual runtime selection logic handled by the control plane when you create an InferenceService.\n\n**Advanced Deployment Architectures**\n\nServingRuntimes serve as blueprints for how router, engine, and decoder components are deployed. Each component (except router) can be configured for single-node, serverless, or multi-node deployment. This flexibility enables cutting-edge serving patterns:\n**PD-Disaggregated Serving** - The state-of-the-art for high-performance LLM serving at scale\n\nThis isn’t just incremental improvement—it’s a fundamental advancement in serving architecture that OME makes accessible through simple runtime configuration.\n\n### **InferenceService: Orchestrating Model Deployments and Ingress**\n\nAn InferenceService is the central Kubernetes resource in OME that orchestrates the complete lifecycle of model serving. It acts as a declarative specification that describes how you want your AI models deployed, scaled, and served across your cluster.\n\nThink of InferenceService as the “deployment blueprint” for your AI workloads. It brings together models (defined by BaseModel/ClusterBaseModel), runtimes (defined by ServingRuntime/ClusterServingRuntime), and infrastructure configuration to create a complete serving solution. InferenceService is what puts models, runtimes, as well as traditional Kubernetes services, complex ingress, scheduling, auto scaling, and permission controls all together to form a complete cluster serving fleet.\n\n**Architecture Overview**\n\nOME uses a component-based architecture where InferenceService can be composed of multiple specialized components:\n\n- **Model**: References the AI model to serve (BaseModel/ClusterBaseModel)\n- **Runtime**: References the serving runtime environment (ServingRuntime/ClusterServingRuntime)\n- **Engine**: Main inference component that processes requests, typically an OpenAI-compatible server handling request processing, tool parsing, and model backend operations\n- **Decoder**: Optional component for disaggregated serving (prefill-decode separation)\n- **Router**: A standalone high-performance component that enables data parallelism across inference instances, supporting advanced load balancing algorithms (cache-aware, power of two, random, round robin) and acting as a specialized load balancer for prefill-decode disaggregated serving architectures\n\n```yaml\napiVersion: ome.io/v1beta1\nkind: InferenceService\nmetadata:\n  name: production-chat-service\nspec:\n  model:\n    name: llama-3-70b-instruct\n  engine:\n    minReplicas: 2\n    maxReplicas: 10\n  decoder:  # Only created for disaggregated deployments\n    minReplicas: 4\n    maxReplicas: 20\n  router:  # Optional optimal serving routing layer\n    minReplicas: 2\n```\n\nThis component architecture enables sophisticated optimizations impossible with monolithic deployments:\n- **Independent Scaling**: Scale compute-heavy prefill separately from memory-bound decode\n- **Resource Optimization**: Routers don’t need GPUs, saving precious accelerator resources\n- **Failure Isolation**: Component failures don’t bring down the entire service\n- **Performance Tuning**: Each component can be optimized for its specific workload\n\n### **BenchmarkJob: Performance Testing as a First-Class Operation**\n\nOME is the only platform that treats performance testing as a core primitive:\n\n```yaml\napiVersion: ome.io/v1beta1\nkind: BenchmarkJob\nmetadata:\n  name: llama-70b-production-benchmark\nspec:\n  # Target service to benchmark\n  endpoint:\n    inferenceService:\n      name: llama-chat-optimized\n  outputLocation:\n    storageUri: \"oci://n/benchmark-results/b/prod/o/llama-70b-bench\"\n```\n\nThis isn’t just about running load tests. BenchmarkJob provides:\n- **genai-bench integration**: Industry-standard benchmarking tool\n- **Realistic traffic patterns**: Normal distributions, fixed patterns, long-context scenarios\n- **Comprehensive metrics**: Tokens/second, TTFT, latency percentiles\n- **Multi-cloud storage**: Results stored for historical analysis\n- **Service metadata tracking**: GPU types, engine versions for fair comparisons\n\n### **Admission Webhooks: Validation and Mutation**\n\nOME’s admission webhooks act as gatekeepers in the API layer:\n\n1. **Validating Webhooks** ensure model-runtime compatibility before resources are created, preventing runtime failures\n2. **Mutating Webhooks** inject optimal configurations based on model characteristics\n3. **Pod Mutating Webhooks** handle complex scenarios like:\n    - RDMA configuration for multi-node deployments\n    - GPU affinity rules for optimal memory bandwidth\n    - Security contexts for model encryption\n\n### **Layer 2: Control Plane - The Orchestrator**\n\nThe control plane is where OME’s main operation lives. This isn’t just CRUD operations on Kubernetes resources—it’s a sophisticated system that makes optimal decisions based on model characteristics, hardware availability, and business requirements.\n\n### **OME Controller Manager: The Orchestration Brain**\n\nThe controller manager coordinates all OME operations with a reconciliation loop that’s aware of ML-specific concerns.\n\n**Runtime Selection Algorithm**\n\nWhen you deploy a model through an InferenceService, the controller:\n- Matches model characteristics against all available ServingRuntimes\n- Scores each runtime based on compatibility and optimization potential\n- Uses **Model Size Range** matching—when multiple runtimes support a model, OME selects the one with the closest size range for optimal performance\n- Handles edge cases like quantized models or models requiring specific GPU features\n\n**Component Orchestration**\n\nThe InferenceService controller orchestrates multiple components based on your deployment requirements:\n\n```go\n// Simplified reconciliation logic showing component-based orchestration\nfunc (r *Reconciler) Reconcile(ctx context.Context, req ctrl.Request) (ctrl.Result, error) {\n    // 1. Fetch InferenceService and determine deployment mode\n    inferenceService := &omev1beta1.InferenceService{}\n    deploymentMode := r.inferDeploymentMode(isvc)\n    \n    // 2. Select optimal runtime if not specified\n    if isvc.Spec.Runtime == nil {\n        runtime := r.selectOptimalRuntime(isvc.Spec.Model, deploymentMode)\n        isvc.Spec.Runtime = runtime\n    }\n    \n    // 3. Reconcile components based on deployment mode\n    switch deploymentMode {\n    case PDDisaggregated:\n        // Deploy separate engine (prefill) and decoder components\n        r.reconcileRouter(isvc)    // Cache-aware routing\n        r.reconcileEngine(isvc)    // Prefill processing\n        r.reconcileDecoder(isvc)   // Token generation\n        \n    case MultiNode:\n        // Deploy using LeaderWorkerSet for distributed serving\n        r.reconcileMultiNodeComponents(isvc)\n        \n    default:\n        // Standard single-component deployment\n        r.reconcileEngine(isvc)    // Handles both prefill and decode\n        if isvc.Spec.Router != nil {\n            r.reconcileRouter(isvc) // Optional routing layer\n        }\n    }\n}\n```\n\n**Deployment Mode Decision Logic**\n\nThe controller automatically determines the optimal deployment pattern:\n\n- **RawDeployment**: Single engine for models that fit on one node\n- **PDDisaggregated**: Separate prefill/decode for high-throughput scenarios\n- **MultiNode**: Distributed serving for massive models (e.g., DeepSeek V3 685B)\n- **Serverless**: Scale-to-zero for cost optimization (via Knative integration)\n\n### **Layer 3: Data Plane - Where Models Come to Life**\n\nThe data plane is where OME’s architectural decisions deliver real value. This layer handles the actual model serving with sophisticated optimizations.\n\n### **Model Agent: Model Distribution**\n\nThe Model Agent is OME’s data plane component responsible for making models available across your cluster. When you create a BaseModel resource, the Model Agent springs into action:\n\n**What Makes Model Distribution Powerful:**\n\n1. **Automatic Model Parsing**: Downloads and parses the model’s `config.json` and `safetensors` file headers, extracting architecture details, parameter counts, supported features, and optimal serving configurations. No more manual specification of model characteristics.\n2. **Multi-Cloud Storage Abstraction**: The `hf://` prefix in your BaseModel isn’t just syntactic sugar. OME supports multiple storage backends with a unified interface. Switch from HuggingFace to OCI Object Storage by changing one line—no code modifications needed.\n3. **Node-Aware Distribution**: Models aren’t blindly copied everywhere. The Model Agent runs as a DaemonSet, honoring node selectors and affinity rules, only downloading models to nodes that match your specifications. This saves precious NVMe space and reduces download times.\n4. **Lifecycle Management**: Models are tracked, versioned, and health-checked. If a node goes down, OME ensures model availability on other nodes. When you delete a BaseModel, cleanup happens automatically across all nodes.\n\n![mode-agent.svg](/images/blog/ome/mode-agent.svg)\n\n**The Scout-Gopher Architecture**\n\nOME’s Model Agent employs a sophisticated producer-consumer pattern:\n\n**1. Scout Component: The Distribution Layer**\n\nThe Scout acts as the brain of model distribution, continuously monitoring the Kubernetes API for BaseModel and ClusterBaseModel resources.\n\n- **Node-Aware Filtering**: Scout evaluates node selectors and affinity rules, ensuring models are only downloaded to appropriate nodes.\n- **Graceful Deletion Handling**: When models are deleted, Scout ensures complete cleanup across all nodes before releasing resources, preventing orphaned multi-gigabyte files.\n\n**2. Gopher Component: The Task Engine**\n\n**Storage Backend Performance**:\n\n- **OCI Object Storage**: Achieves GB/s download speeds through parallel chunk downloads and 20-thread concurrency. A 140GB Llama 3 70B model downloads in minutes.\n- **HuggingFace Hub**: Production-grade Golang client with automatic retry, rate limit handling, and resume support for interrupted downloads.\n- **Unified Interface**: Switch between storage providers by changing one URI prefix—no code changes needed.\n\n**3. Model Configuration Parser**\n\nThe parser automatically extracts model metadata from config.json and safetensors files, determining exact parameter counts and capabilities. This eliminates manual configuration for 30+ supported model architectures.\n\n**4. State Management & Cleanup**\n\nOME provides self-healing state management through:\n\n- **ConfigMap Reconciliation**: Automatically recreates deleted ConfigMaps through internal cache, ensuring model states are never lost\n- **Node Labels**: Enable pod scheduling decisions with labels like `models.ome.io/basemodel.llama-3-70b=Ready`\n- **Finalizer-Based Cleanup**: Ensures complete model removal across all nodes before deletion, even handling node failures gracefully\n\n**The Result: Production-Grade Model Management**\n\nThis architecture delivers capabilities unmatched by traditional approaches:\n\n- **Scale**: Tested with large multi-gigabyte models, supporting multiple nodes downloading multiple models simultaneously\n- **Efficiency**: Models download once per node, not per pod—saving petabytes of bandwidth\n- **Reliability**: Self-healing ConfigMaps, automatic retries, and graceful error handling ensure models are always available\n- **Performance**: GB/s download speeds with OCI Object Storage, 20x faster than naive implementations\n- **Intelligence**: Automatic model understanding eliminates manual configuration errors\n\n### **Inference Workloads**\n\nBased on your InferenceService specification, OME deploys different components optimized for specific workload patterns, including PD-disaggregated serving, multi-node serving, standard deployment, and serverless deployment.\n\n| Component | When Used | Primary Function | Key Optimizations |\n| --- | --- | --- | --- |\n| **Engine** | All deployments | Inference server (prefill in PD mode, full inference otherwise) | • Compute optimization• Batch processing• Tensor parallelism |\n| **Decoder** | PD-disaggregated only | Token generation with KV cache from engine | • Memory bandwidth optimization• Efficient cache management |\n| **Router** | When specified or PD mode | Optimized request distribution | • Cache-aware routing• Connection pooling• Health monitoring |\n| **Ingress** | Automatically created | External API access | • TLS termination• Rate limiting• Request routing |\n\nThe beauty of this architecture is its flexibility—start with a simple engine-only deployment and progressively adopt advanced patterns as your needs grow.\n\n### **Layer 4: External Integrations - Ecosystem Power**\n\nOME doesn’t reinvent the wheel—it deeply integrates with the Kubernetes ecosystem:\n\n**Kubernetes Ecosystem Integration:** Deep integration with modern Kubernetes components including [Kueue](https://kueue.sigs.k8s.io/) for gang scheduling of multi-pod workloads, [LeaderWorkerSet](https://github.com/kubernetes-sigs/lws) for resilient multi-node deployments, [KEDA](https://keda.sh/) for advanced custom metrics-based autoscaling, [K8s Gateway API](https://gateway-api.sigs.k8s.io/) for sophisticated traffic routing, and [Gateway API Inference Extension](https://gateway-api-inference-extension.sigs.k8s.io/) for standardized inference endpoints.\n\n## SGLang: First-Class Runtime Support\n\nSGLang is the primary runtime in OME, with deep native integration that showcases OME’s model-driven architecture capabilities.\n\n### Native Router Integration\n\nOME provides native integration with SGLang’s router component, implementing:\n\n**Kubernetes Service Discovery**: The router automatically discovers engine and decoder pods through Kubernetes APIs, adjusting to scaling events and pod lifecycle changes without manual intervention.\n\n**Least-Privilege RBAC**: Each router receives minimal permissions—only the ability to list, get, and watch pods in its namespace. This prevents cross-tenant information leakage while enabling dynamic discovery.\n\n### Load Balancing Capabilities\n\nOME supports SGLang’s advanced load balancing strategies:\n\n**For PD-Disaggregated Deployments**: The router distributes requests between prefill (engine) and decode (decoder) components, maintaining KV cache coherency and optimizing throughput.\n\n**For Standard Deployments**: Cache-aware load balancing tracks KV cache state across workers using RadixAttention, routing requests to workers most likely to have relevant cached prefixes.\n\n### Deployment Flexibility\n\nThrough OME’s ServingRuntime configurations, SGLang supports:\n\n- **Single-node serving** for models that fit on one GPU\n- **Multi-node serving** with tensor/pipeline parallelism for large models\n- **PD-disaggregated serving** separating compute-intensive prefill from memory-bound decode\n- **Expert parallelism** for MoE models like DeepSeek V3\n\nThe integration between OME and SGLang demonstrates how a model-driven architecture enables sophisticated serving patterns while maintaining operational simplicity.\n\n## Production-Grade Features: Built for Scale\n\n### Native Benchmarking\n\nOME includes BenchmarkJob as a core CRD, enabling systematic performance testing with realistic traffic patterns, concurrency sweeps, and automated result storage. This allows teams to compare different model configurations, runtime settings, and hardware choices with standardized, reproducible benchmarks.\n\n### Multi-LoRA Serving: One Model, Many Adapters\n\nDeploy a single base model with multiple LoRA adapters for different use cases:\n\nEach request can specify which adapter to use, enabling multi-tenant serving with a single deployment.\n\n### High-Performance Serving at Scale\n\n**Prefill-Decode Disaggregation**: Separate compute-intensive prefill from memory-bound decode operations, achieving 2.5x throughput improvement for mixed workloads.\n\n**Multi-Node Serving**: Seamlessly scale models across multiple nodes with RDMA support, enabling deployment of frontier models like DeepSeek V3 (685B parameters).\n\n**GB/s Download Speeds**: Native OCI Object Storage integration delivers multi-gigabyte per second download speeds, getting models into production faster.\n\n### Enterprise Security: Defense in Depth\n\n**Optional Model Double Encryption**: OME supports double encryption for models, integrating with OCI KMS and OCI Vault for enhanced security when required.\n\n**Fine-Grained Access Control**: RBAC policies control who can deploy which models, with namespace isolation and audit logging.\n\n**Secure Multi-Tenancy**: Complete isolation between different teams’ models and serving infrastructure.\n\n## Real-World Impact: From Months to Days\n\nOME is currently powering production workloads at Oracle Cloud Infrastructure (OCI), where it has transformed their LLM operations:\n\n### Operational Transformation at Scale\n\n**Before OME:**\n- Model onboarding: Months of manual configuration\n- Runtime selection: Trial and error approach\n- Benchmarking: Ad-hoc, inconsistent processes\n- Serving configuration: Specialized knowledge required\n\n**With OME:**\n- Model onboarding: Days with automated workflows\n- Runtime selection: Automatic and optimal\n- Benchmarking: Standardized and reproducible\n- Serving configuration: Declarative and simple\n\nThe impact has been dramatic—what previously required months of specialized engineering effort now happens in days with standardized, automated processes. Teams can focus on evaluating model capabilities rather than wrestling with infrastructure complexity.\n\n## Closing the Gap: How OME Bridges Two Worlds\n\nRemember the two teams we started with? The ML Engineers perfecting model serving, and the Production Engineers trying to deploy models quickly?\n\nOME closes this gap through its model-driven architecture:\n\n**For ML Engineers**: Your optimizations are captured in ServingRuntimes. Your benchmarking results guide future deployments. Your expertise becomes reusable infrastructure.\n\n**For Production Teams**: Deploy any model with a simple InferenceService. The platform handles runtime selection, scaling, and optimization automatically.\n\n**For Organizations**: Standardized workflows, reduced time to production, and the ability to leverage cutting-edge serving techniques without deep expertise.\n\nThe model-driven approach transforms the chaos of LLM deployment into a systematic, scalable process. By making models first-class citizens, OME enables both innovation and operational excellence.\n\n## The Path Forward: Challenges Ahead\n\nWhile OME has transformed model serving at OCI, significant challenges remain as we build toward a truly universal LLM platform:\n\n### Accelerator-Aware Runtime Selection\n\nCurrently, mixed GPU clusters (H100, A100, L40S) require separate runtime configurations for each accelerator type, leading to runtime proliferation and operational complexity. We’re working on AcceleratorClass abstractions to enable single runtimes that adapt to available hardware automatically.\n\n### Multi-Cloud Support\n\nOME’s current implementation is tightly coupled to OCI. As organizations increasingly adopt multi-cloud strategies, we need to decouple provider-specific logic and create a unified interface that supports AWS, Azure, GCP, and on-premises deployments without code duplication.\n\n### Multi-Cluster Management\n\nFuture architectures will support a single management cluster running OME that can orchestrate model deployments across multiple worker clusters, enabling federation across regions and cloud providers.\n\nThe journey to simplify LLM deployment continues. Each challenge presents an opportunity to make model serving more accessible, efficient, and powerful for organizations worldwide.\n\n## Join the Revolution\n\nOME represents a paradigm shift from deployment-driven to model-driven infrastructure. By abstracting complexity while exposing powerful capabilities, it enables organizations to focus on delivering AI value rather than wrestling with infrastructure.\n\n**Get Involved:**\n- **GitHub**: [github.com/sgl-project/ome](https://github.com/sgl-project/ome)\n- **Documentation**: [docs.sglang.io/ome](https://docs.sglang.io/ome/)\n- **Community**: Join our [Slack](https://slack.sglang.io/) for support and discussions\n- **Contribute**: We welcome contributions from the community\n\n## Acknowledgments\n\nWe would like to express our heartfelt gratitude to the following teams and collaborators:\n\n**SGLang Community** — Yineng Zhang, Ying Sheng, Lianmin Zheng — for their groundbreaking work on SGLang and continuous collaboration on making it the flagship runtime for OME.\n\n**Oracle Cloud Infrastructure Team** — Simo Lin, Chang Su, Beiwen Guo, Yifeng Liu, David Nahm, Feng Gao, Frank Zhou, Weiwei Zheng, Arthur Cheng, Chao Yang, Varun Shenoy, Jinguo Zhang, Wei Gao, Jun Qian, Jingqiao Zhang and colleagues — for driving the vision of model-driven infrastructure and validating OME in production at scale.\n\nThank you all for your invaluable support and collaboration.\n\n---\n\n*OME is transforming how organizations deploy and manage LLMs at scale. Join leading enterprises already using OME to power their AI infrastructure with model-driven simplicity and cutting-edge performance.*\n","slug":"2025-07-08-ome"},"__N_SSG":true}