{"pageProps":{"frontmatter":{"title":"Unified FP8: Moving Beyond Mixed Precision for Stable and Accelerated MoE RL","author":"InfiXAI Team, Ant Group AQ Team, SGLang RL Team, miles Team, slime Team","date":"November 20, 2025","previewImg":"/images/blog/fp8-rl/3_Megatron.png"},"content":"\n> **TL;DR:**\n> \n> **We have implemented fully FP8-based sampling and training in RL. Experiments show that for MoE models, the larger the model, the more severe the train–inference discrepancy becomes when using BF16 training with FP8 rollout. In contrast, using unified FP8 for both training and rollout effectively eliminates train–inference inconsistency caused by quantization error, improving both the speed and stability of RL training.**\n\nThe SGLang RL Team and the slime community have recently conducted some interesting explorations around RL training stability and acceleration:\n\n- In terms of **training stability**, by [aligning the SGLang and FSDP backends](https://github.com/THUDM/slime/tree/main/examples/true_on_policy), we achieve **strictly zero KL divergence** between the rollout and training processes on dense models, reaching perfect train–inference consistency.\n\n- In terms of **training acceleration**, we introduce [**Speculative Decoding**](https://github.com/zhaochenyang20/Awesome-ML-SYS-Tutorial/blob/main/rlhf/slime/spec/readme-en.md) into the RL sampling pipeline, which can significantly speed up sampling under suitable configurations.\n\nBuilding on this, we now share a new progress that balances both stability and performance—**implementing an end-to-end FP8 pipeline for RL training and sampling**. FP8 RL training for Qwen3-4B and Qwen3-30B-A3B has been [fully supported in slime](https://github.com/THUDM/slime/tree/main/examples/low_precision) and is ready to use out of the box.\n\nThis work is jointly completed by the **InfiXAI Team, Ant Group AQ Team, SGLang RL Team, and slime Team**. Special thanks to **DataCrunch** for compute sponsorship and to **NVIDIA** for technical support on Transformer Engine (TE).\n\n## Hardware Foundations of FP8 Training\n\n### **Tensor Cores and Low-Precision Support**\n\nLow-precision computing is a gem of hardware–software co-design. We first introduce its hardware foundation—**Tensor Cores**, a type of **GPU hardware acceleration unit** designed specifically for **large-scale matrix multiplication and accumulation**, the core computation in deep learning. Compared with traditional CUDA cores, Tensor Cores can process low-precision data formats (such as FP16, BF16, FP8) with **much higher throughput**. Their evolution began with basic FMA (fused multiply–add) instructions and early vectorization through DP4A, but the real milestone came with the Volta architecture, which first introduced Tensor Cores as dedicated units for large-scale matrix operations. Since then, Ampere, Hopper, and the latest Blackwell architectures have continued to push this idea further:\n\n- **Scaling up**: Letting Tensor Cores process larger matrices per operation, thereby improving compute-to-memory ratios.\n- **Lowering precision**: Continuously adding support for FP/BF16, FP8, and even lower-precision data formats.\n\n| Arch | FP64 | [F16](https://newsletter.semianalysis.com/p/nvidia-tensor-core-evolution-from-volta-to-blackwell) | INT8 | INT4 | FP8 | MXFP |\n| --- | --- | --- | --- | --- | --- | --- |\n| Volta | ❌ | ✅ FP16 | ❌ | ❌ | ❌ | ❌ |\n| Turing | ❌ | ✅ FP16 | ✅ | ✅ | ❌ | ❌ |\n| Ampere | ✅ | ✅ FP16/BF16 | ✅ | ✅ | ❌ | ❌ |\n| Hopper | ✅ | ✅ FP16/BF16 | ✅ | ❌ | ✅ [(accumulation precision only supports FP22)](https://arxiv.org/html/2505.09343v1) | ❌ |\n| Blackwell | ✅ | ✅ FP16/BF16 | ✅ | ❌ | ✅ | ✅ MXFP(8/6/4)<br>NVFP4 |\n| Blackwell Ultra | ✅ (reduced FLOPs) | ✅ FP16/BF16 | ✅ (reduced FLOPs) | ❌ | ✅ | ✅ MXFP(8/6/4)<br>NVFP4 |\n\n> Figure source: [zartbot](https://mp.weixin.qq.com/s?__biz=MzUxNzQ5MTExNw==&mid=2247496740&idx=1&sn=c9403138fa59d126fe6cfda19d9b2f76&chksm=f995e4e6cee26df07bf7101b58cbdfdf80d577c67122304482e3e788edfa74a71135dbf77d36&cur_album_id=3289258526057463810&scene=189#wechat_redirect), [SemiAnalysis](https://newsletter.semianalysis.com/p/nvidia-tensor-core-evolution-from-volta-to-blackwell)\n\nUnder this hardware trend, using lower precision for storage and computation becomes increasingly attractive. Concretely, lower-precision floating-point formats offer several potential advantages:\n\n1. **Significantly reduced memory footprint**: Compared with mainstream BF16, FP8 can theoretically halve the memory consumed by model weights and activations, directly alleviating ever-growing VRAM pressure.\n2. **Theoretically 2× compute throughput**: On mainstream GPUs (e.g., H100 SXM), FP8 Tensor Cores offer up to 1979 TFLOPS of theoretical performance, twice that of BF16 units (989 TFLOPS). This substantial performance gain is a key driver behind FP8 training.\n3. **Mitigated memory bandwidth bottlenecks**: With more compact data representation, less data must be transferred from GPU HBM to compute cores. This means less time spent on data movement and effectively reduces memory-bandwidth pressure.\n\n### **FP8 Formats**\n\nFP8 is a floating-point format that uses 8 bits to represent values. Compared with FP32 (32 bits) and FP16/BF16 (16 bits), FP8 can reduce storage and transmission costs for the same amount of data to 1/4 or 1/2, greatly easing VRAM and bandwidth bottlenecks and improving training and inference performance. Currently, there are two major FP8 formats:\n\n- **E4M3**: 4-bit exponent + 3-bit mantissa. Smaller dynamic range but higher precision.\n- **E5M2**: 5-bit exponent + 2-bit mantissa. Larger dynamic range but lower precision.\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/1_E4vsE5.png\" alt=\"FP8 E4M3 vs E5M2\" width=\"80%\" />\n</p>\n\n> Figure source: [OCP whitepaper](https://www.opencompute.org/documents/ocp-microscaling-formats-mx-v1-0-spec-final-pdf)\n\nThis design allows FP8 to maintain sufficient numerical range and precision while maximizing hardware throughput.\n\n### FP8 Scale Selection\n\n| **Dimension** | **FP32 Scale (full-precision scaling factor)** | **E8M0 Scale (exponent-only scaling)** |\n| --- | --- | --- |\n| **Format definition** | **FP32** (IEEE 754 single-precision float) | **E8M0** (8-bit exponent, 0-bit mantissa) |\n| **Numeric properties** | Can represent real numbers with arbitrary precision. | Only supports **powers of 2**, such as 1, 2, 0.5; cannot represent values like 1.5. |\n| **Core idea** | Manage scaling factors in high precision to ensure numerical stability during training. | Bring scaling factors into the low-precision regime and leverage bit operations for efficiency. |\n| **Main advantages** | 1. **High precision, stable training**: Accurately captures dynamic ranges, reduces quantization error, and prevents divergence.<br>2. **Broad support**: Default choice in mainstream libraries such as NVIDIA Transformer Engine; mature ecosystem. | 1. **Extremely hardware-friendly**: Scaling can be implemented as simple **bit shifts**, which are very fast and energy-efficient.<br>2. **Unified pipeline**: The entire pipeline (including scale) runs in 8 bits, simplifying hardware design. |\n| **Main disadvantages** | 1. **Storage overhead**: Each quantized tensor needs to store one extra FP32 scale value, consuming some VRAM.<br>2. **Compute overhead**: Scale calculations and conversions must be done in FP32. | 1. **Precision-loss risk**: Forcing rounding to powers of 2 introduces quantization noise, which can accumulate during backprop and cause divergence.<br>2. **Limited dynamic-range resolution**: Harder to finely adapt to complex tensor distributions. |\n| **Summary** | Currently the most common and safest scheme in industry. | Sacrifices some precision in exchange for extreme hardware efficiency. |\n\nAfter a comprehensive evaluation, we ultimately chose **FP32** as the scale precision during training. The reasons are:\n\n1. **Precision alignment and training stability**: FP32 scales provide fine-grained numerical scaling that captures tensor dynamic ranges and keeps FP8 training loss curves as close as possible to the **BF16** baseline.\n2. **Consistency with inference ecosystems**: Mainstream inference models also use FP32 as the quantization scale format.\n3. **Real-world hardware benefits**:\n   - **Hopper (H100/H800)**: Although it supports FP8 Tensor Cores, it has no dedicated compute units for E8M0 scaling.\n   - **Blackwell (B100/B200)**: Introduces support for MXFP8 (micro-scaling), which provides hardware acceleration for block-level scaling like E8M0 (see [**arXiv:2506.08027**](https://arxiv.org/abs/2506.08027)).\n\nTherefore, under current H-series clusters, forcing the use of E8M0 not only fails to deliver clear speedups, but may also introduce additional software-emulation overhead and precision risks.\n\n### FP8 Quantization\n\nCommon quantization strategies include **per-tensor**, **per-block**, and **per-token**. Regardless of granularity, quantization usually follows two simple steps:\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/2_size.png\" alt=\"FP8 quantization flow\" width=\"80%\" />\n</p>\n\n> Figure source: [InfiR2: A Comprehensive FP8 Training Recipe for Reasoning-Enhanced Language Models](https://arxiv.org/html/2509.22536v4)\n\n**Step 1: Compute the scaling factor $S$**\n\nTake the maximum absolute value $\\max|X|$ in a given tensor (or block) and divide it by the maximum representable FP8 value $V_{\\max}$:\n\n$$\nS = \\frac{\\max|X|}{V_{\\max}}\n$$\n\n**Step 2: Compute the quantized value $Q$**\n\nUsing the scaling factor **$S$**, divide each element $x$ in the original tensor $X$ by **$S$** and round to the nearest integer to obtain quantized values:\n\n$$\nQ(x) = \\mathrm{round}\\left(\\frac{x}{S}\\right)\n$$\n\nBecause FP8 has lower precision than FP16/BF16, we must trade off between training stability and efficiency in practice, so forward and backward passes often use different quantization strategies and granularities:\n\n- **Activations**: Typically use per-token quantization. Activations often contain significant outliers; finer quantization granularity can localize the effect of outliers and better preserve overall precision.\n- **Weights**: Typically use per-block quantization. After convergence, weight distributions are usually smooth (close to Gaussian) with few outliers, but are highly sensitive to quantization error. Blockwise quantization (e.g., block_size × block_size) maintains precision while working well with hardware optimizations, balancing compute efficiency and memory savings.\n- **Gradients**: Typically use per-token quantization. Gradients have large dynamic-range variation but relatively low absolute precision requirements. Historically, most schemes used **per-tensor E5M2** to ensure dynamic range, but DeepSeek-V3 shows that fine-grained E4M3 can also balance precision and range.\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/3_Megatron.png\" alt=\"Mixed-granularity FP8 quantization in Megatron\" width=\"80%\" />\n</p>\n\n> Figure source: [InfiR2: A Comprehensive FP8 Training Recipe for Reasoning-Enhanced Language Models](https://arxiv.org/html/2509.22536v4)\n\nThe figure shows the mixed-granularity FP8 strategy used in Megatron compared to a standard BF16 pipeline. In the FP8 pipeline, different quantization methods are applied: weights use per-block quantization (blue), while activations use per-token quantization (purple). The figure presents the full training process, including forward propagation (FProp), weight-gradient computation (Wgrad), and input-gradient computation (Dgrad), and details the FProp workflow.\n\n## Challenges of FP8 Training\n\nAlthough FP8 shows great potential, in real engineering practice—especially when combining Megatron-Core and TransformerEngine (TE)—we encounter three main challenges: **memory/efficiency not meeting expectations, difficulty aligning precision, and stability issues in the framework itself.** We refer to our unified FP8 training-and-inference setup as **FP8-TI (FP8 Training & Inference)**.\n\n### **Memory and Compute Efficiency: Theory vs. Reality**\n\nIn practice, the memory savings and speedups brought by FP8 are often less significant than theory suggests, mainly due to:\n\n- **Limited memory optimization**:\n  - **Redundant weight copies**: To speed up backprop, TransformerEngine [keeps an extra transposed copy of quantized weights](https://github.com/NVIDIA/TransformerEngine/blob/main/transformer_engine/common/transpose/quantize_transpose_square_blockwise.cu#L481). This prevents weight memory usage from being reduced by the expected factor of 2.\n  - **High-precision activation copies**: In the forward pass of attention and activation layers, frameworks typically retain a high-precision copy of activations for accurate gradient computation later. FP8 does not reduce this portion of memory usage.\n- **Compute-efficiency bottlenecks**:\n  - **Performance degradation with small batch sizes**: When batch_size is small, FP8 training may fail to fully utilize GPU compute units and can even underperform BF16. The root cause is that FP8 introduces extra quantization and dequantization operations, which add CPU overhead. In Agentic RL scenarios, which typically use small batch sizes (e.g., batch_size=4), this issue is particularly pronounced—frequent CPU overhead can make FP8 training slower than BF16. (As shown below, GPU kernels are not densely scheduled; often the GPU has already finished the previous work but the next kernel launch is delayed because the system is CPU-bound.)\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/4_cpu_bound.png\" alt=\"CPU bound for FP8 training\" width=\"80%\" />\n</p>\n\n> Figure: CPU-bound behavior in FP8 training\n\n### **Precision Alignment: Cumulative Error Matters**\n\nThe low-precision nature of FP8 inherently introduces numerical discrepancies relative to BF16, which can be amplified in deep models and cause training-instability problems:\n\n- **Intrinsic quantization error**: Even if accumulation is performed in FP32, quantizing FP8 inputs for a single GEMM operation introduces error. Experiments show that compared with BF16 GEMM, the typical error is about 0.0007.\n- **Layer-wise cumulative effect**: In deep Transformer models, these small errors accumulate layer by layer during forward and backward passes:\n  - **In pre-training and fine-tuning (SFT)**: Gradients are mainly dominated by the log probabilities of ground-truth labels. With fine-grained blockwise quantization, errors can usually be kept within an acceptable range and models are unlikely to collapse.\n  - **In reinforcement learning (RL)**: Gradients are often determined by the difference between two log probabilities from two forward passes. In this case, accumulated FP8 error can be amplified, causing gradients to deviate from their ideal direction and impacting convergence efficiency—or even pushing the optimization “in the wrong direction” (as discussed later).\n\n### **Framework Adaptation: TransformerEngine Version Compatibility**\n\nBesides algorithmic challenges, there is room for improvement in how Megatron-Core integrates with **Transformer Engine (TE)**, especially given TE’s rapid iteration:\n\n- **Version dependencies and migration overhead**: TE’s fast iteration brings new features but also strict version dependencies. In practice, we found that even the same training script can yield different numerical behaviors across TE versions, and sometimes code adjustments are required to avoid issues such as NaNs.\n- **Maturity for specific architectures**: Full FP8 support for **all mainstream model architectures** is an ongoing process. For some **nonstandard or newer components** (such as MLA), we observed that FP8 training support is still maturing. Even in later versions (e.g., 2.4.0 → 2.8.0), certain errors and limitations remain to be resolved.\n- **Conflicts with memory-optimization strategies**: In RL training, enabling Optimizer CPU Offload can significantly reduce memory usage, but current TE does not support using it together with `--fp8-param-gather`. Because of this limitation, end-to-end FP8 training can end up consuming more memory than BF16 training with FP8 rollout, which needs further optimization from the community and maintainers.\n\n## **FP8 + RL: Attributing Abnormal KL Loss**\n\nThe **InfiXAI Team** has already successfully run full FP8 training on **pre-training and fine-tuning tasks** (see [Pre-training and Fine-tuning](https://arxiv.org/html/2509.22536v4)). Building on this, we apply FP8 training to RL. Thanks to slime’s good support for Megatron FP8 training, we were able to run a series of FP8 RL experiments smoothly.\n\n### **Abnormal Initial KL Loss**\n\nWhen we directly switched from BF16 to FP8 and started training, we observed a striking phenomenon: compared with BF16 training, FP8 training has a significantly higher KL loss at the first step. As shown below, the initial KL loss for **FP8-TI** is significantly higher than that of BF16 training with FP8 inference (T denotes Training, I denotes Inference):\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/5_KLloss.png\" alt=\"Initial KL loss comparison\" width=\"80%\" />\n</p>\n\n### **Locating the Source of Error**\n\nTo understand why initial KL loss is higher, we analyze two potential error sources in the quantization process:\n\n1. **Error from quantized compute kernels**: Numerical error from specific FP8 GEMM implementations.\n2. **Intrinsic quantization error**: Precision loss from quantization and dequantization themselves.\n\n**Error analysis of quantized compute kernels**\n\nInitially, we suspected that the closed-source cuBLAS GEMM implementation used in TransformerEngine might be less accurate than the widely used open-source DeepGEMM, so we designed experiments to compare the precision of these two FP8 GEMM implementations against BF16. We evaluated their errors under various shapes (based on TE’s test cases), with results shown below:\n\n| **Kernel (M, K, N)** | **cuBLAS(TE)** | **DeepGEMM** |\n| --- | --- | --- |\n| 128,128,128 | 0.00068 | 0.00036 |\n| 256,128,256 | 0.00068 | 0.00037 |\n| 320,128,336 | 0.000684 | 0.00037 |\n| 320,64,336 | 0.00067 | 0.00024 |\n| 320,256,336 | 0.00068 | 0.00048 |\n| 1024,4096,1024 | 0.000681 | 0.00065 |\n| 2048,2048,512 | 0.00068 | 0.00063 |\n| 1024,1024,1024 | 0.000683 | 0.0006 |\n\nThe results show that the errors of the two GEMM implementations are of the same order of magnitude with no significant difference, so replacing TE’s FP8 GEMM does not reduce the initial KL loss.\n\n**Analysis of intrinsic quantization error**\n\nFor the second potential source, we designed a set of comparative experiments to isolate and validate the **intrinsic** error of quantization:\n\n- **Baseline**: Qwen3-4B on a single H800.\n- **Experimental modes**:\n  1. **Baseline**: Weights and inputs in BF16, using BF16 GEMM.\n  2. **FP8 Real Quant**: Weights and inputs in FP8, using FP8 GEMM (e.g., DeepGEMM/cuBLAS GEMM; we mainly tested cuBLAS to avoid large changes to TE).\n  3. **FP8 Fake Quant**: Weights and inputs kept in BF16, but we simulate the quantization process (quantize to FP8 then dequantize back to BF16), and finally use BF16 GEMM.\n\nBased on these modes, we run two comparisons:\n\n- **FP8 Real Quant vs. FP8 Fake Quant**: To verify the precision of the FP8 GEMM kernels (cuBLAS), isolating any additional error from the implementation.\n- **Baseline vs. FP8 Fake Quant**: To ignore GEMM kernel effects and focus on the intrinsic error introduced by quantization/dequantization themselves.\n\n**Metric**: We collect the output differences (Diff) of all GEMM operations at the beginning of RL training (Step 0 and Step 1).\n\n**Results**:\n\nThe figure below visualizes the error distribution of all GEMM outputs over one full forward + backward pass, in execution order:\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/6_FP8_quant_error.png\" alt=\"FP8 quantization error distribution\" width=\"80%\" />\n</p>\n\n> The figure shows how GEMM output errors evolve over one full iteration.\n>\n> - **Grey/high points (Baseline vs. FP8 Fake Quant)**: Represent error from quantization itself. We can see significant differences between the BF16 baseline and fake quantization.\n> - **Green/low points (FP8 Real Quant vs. FP8 Fake Quant)**: Represent error from the kernel implementation. These differences are extremely small, nearly zero.\n\nFrom this we conclude:\n\n- **Error mainly comes from the quantization principle, not the kernel implementation**: Both Fake Quant and Real Quant differ significantly from the baseline (by two orders of magnitude), strongly indicating that **the dominant error source is the lossy quantization/dequantization itself**, rather than computation.\n- **FP8 GEMM kernels are highly reliable**: The tiny difference between Real Quant and Fake Quant outputs shows that the cuBLAS FP8 GEMM we use in TE is extremely accurate and closely matches the ideal mathematical simulation, making it safe for production.\n\n### **How Quantization Error Leads to Training Anomalies**\n\nBased on the above experiments, we hypothesize:\n\n1. The main error in training is already introduced at the quantization step and is substantial.\n2. The higher initial KL loss in FP8 training likely comes from this quantization error.\n3. In hybrid BF16 training + FP8 inference (rollout), the same quantization error also causes train–inference inconsistency.\n\nTo validate these hypotheses, we modified Transformer Engine (TE) and designed the following experiments:\n\n- **Baseline**: Qwen3-4B on an H800 cluster.\n- **Cases**:\n  - **Case 1**: BF16 training, FP8 rollout (inference).\n  - **Case 2**: BF16 training, FP8 rollout; in the forward pass during training, quantize BF16 weights and activations to FP8 then dequantize back to BF16 before running BF16 GEMM.\n  - **Case 3**: BF16 training, FP8 rollout; in both forward and backward passes during training, quantize both input matrices A and B to FP8 then dequantize back to BF16 before BF16 GEMM.\n  - **Case 4 (FP8-TI)**: FP8 training, FP8 rollout.\n\n**Validating hypothesis 2 — KL-loss analysis**\n\nThe figure below shows KL-loss curves for the four cases. We see that Case 2, Case 3, and Case 4 (FP8-TI) have nearly identical KL loss at step 1, all significantly higher than Case 1:\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/7_KLloss2.png\" alt=\"KL-loss comparison under different cases\" width=\"80%\" />\n</p>\n\n**Validating hypothesis 3 — TIS-clipfrac analysis**\n\nWe introduce **clipfrac** from **Truncated Importance Sampling (TIS)** to validate hypothesis 3. This metric reflects the degree of off-policy training, i.e., the consistency between the model used for training and for generating experience. Higher clipfrac generally indicates more severe train–inference inconsistency.\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/8_TIS.png\" alt=\"TIS-clipfrac comparison under different cases\" width=\"80%\" />\n</p>\n\nFrom the figure we see that Case 2, Case 3, and Case 4 (FP8-TI) have clipfrac values of roughly the same order, all significantly lower than Case 1. This confirms:\n\n1. The root cause of the elevated initial KL loss is quantization error.\n2. **FP8-TI (Case 4)** can significantly alleviate train–inference inconsistency compared with the hybrid BF16 training + FP8 rollout (Case 1).\n3. For training bias, quantization error in the forward pass matters more than in the backward pass (as shown by the similarity between Case 2 and Case 3). Similarly, for train–inference consistency, forward quantization error is the primary factor.\n\n## **Applying FP8 to MoE RL: Experiments and Validation**\n\nDense-model experiments demonstrate that **FP8-TI** effectively suppresses train–inference inconsistency. Building on this, the **Ant Group AQ Team** extended the study to MoE models in RL to evaluate whether **FP8-TI** works well for more complex architectures. We find that **FP8-TI**:\n\n1. **Reduces TIS clip fraction**: Its TIS-clipfrac is significantly lower than that of BF16 Train / FP8 Rollout, meaning fewer clipped updates and higher training stability.\n2. **Narrows the train–rollout log-probability gap**: Compared with BF16 Train / FP8 Rollout, this FP8 scheme yields smaller and more stable differences between training and rollout log probabilities.\n\n### MoE Experiment Design\n\nTo isolate variables for clean comparison, we set up two experimental schemes:\n\n- **Case 1 (mixed precision)**: BF16 training, FP8 rollout.\n- **Case 2 (unified precision)**: FP8 training, FP8 rollout.\n\n**Key metrics**:\n\n- **TIS clip fraction (TIS-clipfrac)**: Measures off-policy training stability; lower is better.\n- **Absolute difference between train and rollout log probabilities (train_rollout_logprob_abs_diff)**: Measures how consistent model behavior is between training and rollout; smaller and more stable is better.\n\n### MoE Results and Analysis\n\n**Qwen3-30B-A3B**\n\n- **Setup**: 2× H20 servers.\n\nOn a 30B-scale MoE model, the results clearly show the advantages of **FP8-TI**:\n\n- **Lower TIS-clipfrac**: **FP8-TI** achieves significantly lower TIS-clipfrac than the BF16 Train / FP8 Rollout baseline, indicating fewer clipped updates and more stable training.\n- **Smaller train–rollout log-probability gap**: **FP8-TI** produces a narrower and more stable range for Train_rollout_logprob_abs_diff, indicating more consistent behavior between training and inference.\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/9_1_TIS.png\" alt=\"Qwen3-30B-A3B TIS-clipfrac\" width=\"49%\" />\n  <img src=\"/images/blog/fp8-rl/9_2_rollout_logprob_abs_diff.png\" alt=\"Qwen3-30B-A3B train_rollout_logprob_abs_diff\" width=\"49%\" />\n</p>\n\n**Qwen3-235B-A22B**\n\n- **Setup**: 16× H20 servers.\n\nTo evaluate scalability, we replicated the experiments on a 235B-scale model and obtained consistent conclusions:\n\n- **Consistent improvements in TIS-clipfrac and train–rollout discrepancy**: As shown below, even at 235B scale, **FP8-TI** continues to reduce TIS-clipfrac and Train_rollout_logprob_abs_diff compared with BF16 Train / FP8 Rollout, demonstrating good scalability.\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/10_1_TIS.png\" alt=\"Qwen3-235B-A22B TIS-clipfrac\" width=\"49%\" />\n  <img src=\"/images/blog/fp8-rl/10_2_rollout_logprob_abs_diff.png\" alt=\"Qwen3-235B-A22B train_rollout_logprob_abs_diff\" width=\"49%\" />\n</p>\n\n**Conclusion**: For MoE RL tasks, using **unified FP8 for both training and inference** improves training stability and effectively suppresses train–inference inconsistency compared with BF16 Train / FP8 Rollout. This advantage is consistently observed from 30B to 235B MoE models.\n\n## **Effect of MoE Model Scale on Train–Inference Inconsistency**\n\nWe further investigate how MoE model size affects train–inference inconsistency under the mixed-precision setting (BF16 Train / FP8 Rollout). Experiments show that **as MoE model size increases, train–inference inconsistency becomes more severe**.\n\nAs shown below, from 30B up to 1T, both **TIS-clipfrac** and **Train_rollout_logprob_abs_diff** increase significantly. This suggests that for BF16 Train / FP8 Rollout, larger models tend to suffer more severe train–inference inconsistency, indirectly highlighting the importance of unified-precision schemes such as **FP8-TI**.\n\n<p align=\"center\">\n  <img src=\"/images/blog/fp8-rl/11_1_TIS.png\" alt=\"TIS-clipfrac under different model scales\" width=\"49%\" />\n  <img src=\"/images/blog/fp8-rl/11_2_rollout_logprob_abs_diff.png\" alt=\"train_rollout_logprob_abs_diff under different model scales\" width=\"49%\" />\n</p>\n\n## Future Work\n\nThank you for reading. We see several directions worth further exploration:\n\n1. Study train–inference inconsistency more deeply, analyze its root causes, and explore better solutions.\n2. Investigate quantization strategies more thoroughly, understand how quantization error arises, and design schemes with lower error.\n3. Improve low-precision training efficiency via better algorithms, frameworks, and hardware–software co-design, hiding the latency of kernel launches and quantization and truly realizing acceleration for both training and inference.\n\n## Acknowledgments\n\nInfiXAI Team: Congkai Xie, Mingfa Feng, Shuo Cai  \nAnt Group AQ Team: Yanan Gao, Zhiling Ye, Hansong Xiao  \nSGLang RL Team: JiLi, Yefei Chen, Xi Chen \nmiles Team: Chenyang Zhao\nslime Team: Zilin Zhu  \nNVIDIA: Juan Yu, NeMo-RL Team","slug":"2025-11-19-fp8-rl"},"__N_SSG":true}